-- -*- M2-comint -*- hash: -1285962778

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : fe1 = constructEmbedding(f,1);

i4 : toString fe1

o4 = {x^2-y+(-.975783+.218743*ii)*zz1, x^3-z+(-.761839-.647767*ii)*zz1, zz1,
     (.634093+.773257*ii)*x+(-.988148-.153504*ii)*y+(-.0530743-.998591*ii)*z
     +(.225371+.974273*ii)*zz1+.946355+.32313*ii}

i5 : R = CC[x,y,z];

i6 : f = { x^2-y, x^3-z, x*y-z, x*z-y^2 };

i7 : fe1 = constructEmbedding(f,1);

i8 : toString fe1

o8 = {x^2-y+(.737407+.675448*ii)*ss1+(-.981769-.190076*ii)*zz1,
     x^3-z+(-.615306-.788289*ii)*ss1+(.950927+.309416*ii)*zz1,
     x*y-z+(-.752093+.659057*ii)*ss1+(-.984793+.173732*ii)*zz1,
     -y^2+x*z+(-.156636-.987656*ii)*ss1+(-.844654+.535312*ii)*zz1,
     (-.785954+.618286*ii)*x+(-.998556-.0537151*ii)*y+(-.0166691+.999861*ii)*
     z+(-.538405+.842686*ii)*ss1+(-.939054-.34377*ii)*zz1-.99999+.00452576*ii
     }

i9 : 
