-- -*- M2-comint -*- hash: 1509569113

i1 : R=CC[a,b,c,d];

i2 : M=matrix for i to 2 list for j to 3 list random(1,R)+random(0,R);
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

             3       4
o2 : Matrix R  <--- R

i3 : I=minors(3,M);

o3 : Ideal of R

i4 : f=flatten entries gens I;

i5 : (w,ns) = topWitnessSet(f,2);
*** variables in the ring : {a, b, c, d, zz1, zz2} ***

i6 : slcmat = matrix applyTable (entries w.Slice, x->1_CC*realPart x);

                2          7
o6 : Matrix CC    <--- CC
              53         53

i7 : Rtwo = ring w.Equations;

i8 : X = transpose matrix {gens Rtwo | {1_CC}};

                7          1
o8 : Matrix Rtwo  <--- Rtwo

i9 : slcRR = flatten entries (promote(slcmat,Rtwo) * X);

i10 : fsols = intersectSlice(w,slcRR)

o10 = {{-.060138-.7274*ii, -1.09045+.333938*ii, .905521+1.02078*ii,
      -----------------------------------------------------------------------
      -1.07839-.605075*ii, 5.06571e-15+2.39776e-15*ii,
      -----------------------------------------------------------------------
      -4.77938e-15-5.39056e-15*ii}, {1.57565+2.31013*ii, -1.35456+.752386*ii,
      -----------------------------------------------------------------------
      -1.16078-2.38823*ii, .574119+3.00826*ii, -1.62028e-15+3.41317e-14*ii,
      -----------------------------------------------------------------------
      6.47954e-14-1.20508e-14*ii}, {1.02903+1.82728*ii, 3.47332+1.81473*ii,
      -----------------------------------------------------------------------
      1.76136-1.31481*ii, 2.86273+3.1105*ii, -6.95054e-14+4.3613e-15*ii,
      -----------------------------------------------------------------------
      1.07898e-13+4.17317e-14*ii}, {.682788-.04522*ii, .774537+.108033*ii,
      -----------------------------------------------------------------------
      .901679+.10455*ii, .861853+.014695*ii, -1.90148e-15-2.31239e-15*ii,
      -----------------------------------------------------------------------
      1.26302e-15-6.19679e-16*ii}, {2.34171-.526688*ii, -1.32884+.77199*ii,
      -----------------------------------------------------------------------
      -2.05811+.988756*ii, 1.43756-.120329*ii, -1.71716e-15+6.16922e-16*ii,
      -----------------------------------------------------------------------
      1.85466e-14+1.30883e-14*ii}, {.403777+.487915*ii, -.327173-.390567*ii,
      -----------------------------------------------------------------------
      .714169-.763133*ii, -.107349+.306024*ii, 3.80375e-16+9.61637e-16*ii,
      -----------------------------------------------------------------------
      1.19764e-17-5.22163e-16*ii}}

o10 : List

i11 : 
