-- -*- M2-comint -*- hash: -1229619679

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);

i9 : q --let's take a look at the start system:

                               3 5                           2              
o9 = {(- .954852 - .297083*ii)x y  + (- .60236 + .798225*ii)x y + (.970884 -
     ------------------------------------------------------------------------
                 2                         2
     .239552*ii)y , (.897122 - .441783*ii)x  + (.999924 - .0123407*ii)x*y +
     ------------------------------------------------------------------------
     .99755 - .069964*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.359906-.731844*ii, -.613268-.251785*ii}, {.051192+.792928*ii,
      -----------------------------------------------------------------------
      -.396244+.564926*ii}, {-.3991-.800404*ii, 1.14531-.477209*ii},
      -----------------------------------------------------------------------
      {-.730486+.705063*ii, 1.10258-.308876*ii}, {.065327-1.52235*ii,
      -----------------------------------------------------------------------
      .530796+.749103*ii}, {.728913-1.01681*ii, -.722296+.609906*ii},
      -----------------------------------------------------------------------
      {.33665+1.07946*ii, -.982922+.028821*ii}, {-.412403+1.49396*ii,
      -----------------------------------------------------------------------
      -.06396-.914887*ii}}

o10 : List

i11 : 
