-- -*- M2-comint -*- hash: -1010838168

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : (w,ns) = topWitnessSet(f,1)
*** variables in the ring : {x, y, z, zz1} ***

o3 = (w, {})

o3 : Sequence

i4 : dim(w)

o4 = 1

i5 : degree(w)

o5 = 3

i6 : toString equations(w)

o6 = {x^2-y+(.782541+.622598*ii)*zz1, x^3-z+(-.298473-.954418*ii)*zz1, zz1}

i7 : toString slice(w)

o7 = {(-.512368-.858766*ii)*x+(-.331907+.943312*ii)*y+(-.0713878-.997449*ii)*
     z+(.680008+.733205*ii)*zz1-.961379+.275227*ii}

i8 : toString points(w)

o8 = VerticalList{Point{...4...}, Point{...4...}, Point{...4...}}

i9 : R = CC[x,y,z]; f = { (x^2-y)*(x-2), (x^3 - z)*(y-2), (x*y - z)*(z-2) }

        3     2              3      3                             2
o10 = {x  - 2x  - x*y + 2y, x y - 2x  - y*z + 2z, x*y*z - 2x*y - z  + 2z}

o10 : List

i11 : (w,ns) = topWitnessSet(f,1);
*** variables in the ring : {x, y, z, zz1} ***

i12 : dim(w)

o12 = 1

i13 : degree(w)

o13 = 3

i14 : #ns

o14 = 10

i15 : 
